<?php
/* ====================
Copyright (c) 2008-2009, Vladimir Sibirov.
All rights reserved. Distributed under BSD License.
==================== */

$L['att_attach'] = 'Прикрепить файл';
$L['att_attachment'] = 'Прикрепленный файл';
$L['att_attachments'] = 'Вложения';
$L['att_cleanup'] = 'Уборка';
$L['att_cleanup_confirm'] = 'Это удалит все файлы, прикрепленные к более не существующим сообщениям. Продолжить?';
$L['att_delete'] = 'Удалить';
$L['att_downloads'] = 'Скачивания';
$L['att_ensure'] = 'Вы уверены?';
$L['att_free'] = 'свободно';
$L['att_info'] = 'Информация';
$L['att_install'] = 'Установить';
$L['att_install_confirm'] = 'Используйте только если устанавливаете в первый раз, иначе все ваши вложения будут испорчены! Продолжить?';
$L['att_installed'] = 'Таблица БД установлена';
$L['att_item'] = 'Элемент';
$L['att_items_removed'] = 'Элементов удалено';
$L['att_kb'] = 'КБ';
$L['att_kb_left_of'] = 'КБ осталось, файлы не более';
$L['att_maxsize'] = 'макс. размер файла';
$L['att_of'] = 'из';
$L['att_remove_all'] = 'Удалить все';
$L['att_replace'] = 'Заменить';
$L['att_show_info'] = 'Показать информацию об элементе';
$L['att_size'] = 'Размер';
$L['att_title'] = 'Название';
$L['att_title_here'] = 'Поместите название здесь';
$L['att_total'] = 'всего';
$L['att_type'] = 'Тип';
$L['att_used'] = 'использовано';
$L['att_user'] = 'Пользователь';
$L['att_your_space'] = 'Ваше пространство';


// Ошибки
$L['att_err_db'] = 'Ошибка базы данных';
$L['att_err_delete'] = 'Невозможно удалить вложение';
$L['att_err_noitems'] = 'Не найдено ни одного элемента';
$L['att_err_nospace'] = 'Недостаточно персонального дискового пространства';
$L['att_err_perms'] = 'У вас недостаточно прав для данного действия';
$L['att_err_replace'] = 'Невозможно заменить файл';
$L['att_err_thumb'] = 'Невозможно создать предпросмотр изображения';
$L['att_err_title'] = 'Название файла оставлено пустым';
$L['att_err_toobig'] = 'Файл слишком велик';
$L['att_err_type'] = 'Такой тип файлов не разрешен';
$L['att_err_upload'] = 'Невозможно загрузить файл, либо он имеет нулевой размер';

// Конфигурация
$L['cfg_folder'] = array('Директория для файлов', '');
$L['cfg_prefix'] = array('Префикс имен файлов', '');
$L['cfg_exts'] = array('Разрешенные типы файлов (через запятую, без точек и пробелов)', '');
$L['cfg_thumbs'] = array('Показывать миниатюры изображений?', '');
$L['cfg_thumb_x'] = array('Макс. ширина миниатюры', '');
$L['cfg_thumb_y'] = array('Макс. высота миниатюры', '');
$L['cfg_items'] = array('Макс. число вложений в каждом сообщении', '');
$L['cfg_order'] = array('Порядок отображения', 'смешанный, сначала изображения, сначала файлы');
$L['cfg_autovalidation'] = array('Включить автовалидацию страниц?', '');
$L['cfg_table'] = array('Имя таблицы в БД', '');
$L['cfg_pages'] = array('Включить вложения в страницах?', '');
$L['cfg_forums'] = array('Включить вложения в форумах?', '');
$L['cfg_listprev'] = array('Показывать изображения предпросмотра в списках страниц?', '');
$L['cfg_userdir'] = array('Включить файлы в пользовательских подпапках?', '');
$L['cfg_prev_x'] = array('Ширина изображения предпросмотра', '');
$L['cfg_prev_y'] = array('Высота изображения предпросмотра', '');
$L['cfg_prev_border'] = array('Толщина рамки изображения предпросмотра', '');
?>